import { z } from "zod";

export const signupSchema = z.object({
  firstName: z
    .string({ required_error: "نام را وارد کنید." })
    .min(3, { message: ".نام باید حداقل 3 کاراکتر باشد" })
    .max(30, { message: ".نام باید حداکثر 30 کاراکتر باشد" })
    .regex(/^[آ-ی]+$/, {
      message: ".نام فقط باید شامل حروف فارسی باشد",
    }),

  lastName: z
    .string({ required_error: "نام خانوادگی را وارد کنید." })
    .min(3, { message: ".نام خانوادگی باید حداقل 3 کاراکتر باشد" })
    .max(30, { message: ".نام خانوادگی باید حداکثر 30 کاراکتر باشد" })
    .regex(/^[آ-ی]+$/, {
      message: ".نام خانوادگی فقط باید شامل حروف فارسی باشد",
    }),

  nationalId: z
    .string({ required_error: "شماره ملی را وارد کنید." })
    .min(11, { message: "شماره ملی باید حداقل 11 کاراکتر باشد" })
    .max(11, { message: "شماره ملی باید حداکثر 11 کاراکتر باشد" })
    .regex(/^\d+$/, {
      message: "شماره ملی فقط باید شامل اعداد باشد",
    }),

  username: z
    .string({ required_error: "نام کاربری را وارد کنید." })
    .min(3, { message: "نام کاربری باید حداقل 3 کاراکتر باشد" })
    .max(30, { message: "نام کاربری باید حداکثر 30 کاراکتر باشد" })
    .regex(/^[a-zA-Z0-9]+$/, {
      message: "نام کاربری فقط باید شامل حروف بزرگ و کوچک انگلیسی و اعداد باشد",
    })
    .refine((s) => !s.includes(" "), {
      message: "نام کاربری نباید شامل فاصله باشد",
    }),

  password: z
    .string({ required_error: "رمز عبور را وارد کنید." })
    .min(8, { message: "رمز عبور باید حداقل 8 کاراکتر باشد" })
    .max(50, { message: "رمز عبور باید حداکثر 50 کاراکتر باشد" })
    .regex(/^[a-zA-Z0-9]*$/, {
      message: "رمز عبور باید فقط شامل حروف انگلیسی بزرگ، کوچک یا عدد باشد",
    })
    .regex(/[A-Z]/, {
      message: "رمز عبور باید شامل حداقل یک حرف بزرگ باشد",
    })
    .regex(/[a-z]/, {
      message: "رمز عبور باید شامل حداقل یک حرف کوچک باشد",
    })
    .regex(/[0-9]/, {
      message: "رمز عبور باید شامل حداقل یک عدد باشد",
    }),

  job: z
    .string({
      required_error: "سمت را وارد کنید.",
    })
    .regex(/^[آ-ی\s]+$/, {
      message: "سمت فقط باید شامل حروف فارسی باشد",
    }),

  phone: z
    .string({
      required_error: "شماره تماس را وارد کنید.",
    })
    .regex(/^09\d{9}$/, {
      message: "فرمت شماره تماس معتبر نیست. لطفاً شماره معتبر وارد کنید.",
    }),

  address: z.string({
    required_error: "آدرس را وارد کنید.",
  }),

  workPhone: z
    .string({
      required_error: "شماره تماس محل کار را وارد کنید.",
    })
    .regex(/^09\d{9}$/, {
      message: "فرمت شماره تماس معتبر نیست. لطفاً شماره معتبر وارد کنید.",
    }),
});
