import { z } from "zod";

export const loginSchema = z.object({
    username: z
      .string({ required_error: "نام کاربری را وارد کنید" })
      // .min(3, { message: "نام کاربری باید حداقل 3 کاراکتر باشد" })
      // .max(30, { message: "نام کاربری باید حداکثر 30 کاراکتر باشد" })
      // .regex(/^[a-zA-Z0-9]+$/, {
      //   message: "نام کاربری فقط باید شامل حروف بزرگ و کوچک انگلیسی و اعداد باشد",
      // })
      .refine((s) => !s.includes(" "), {
        message: "نام کاربری نباید شامل فاصله باشد",
      }),
  
    password: z
      .string({ required_error: "رمز عبور را وارد کنید." })
      .min(8, { message: "رمز عبور باید حداقل 8 کاراکتر باشد" })
      .max(50, { message: "رمز عبور باید حداکثر 50 کاراکتر باشد" })
      .regex(/^[a-zA-Z0-9]*$/, {
        message: "رمز عبور باید فقط شامل حروف انگلیسی بزرگ، کوچک یا عدد باشد",
      })
      .regex(/[A-Z]/, {
        message: "رمز عبور باید شامل حداقل یک حرف بزرگ باشد",
      })
      .regex(/[a-z]/, {
        message: "رمز عبور باید شامل حداقل یک حرف کوچک باشد",
      })
      .regex(/[0-9]/, {
        message: "رمز عبور باید شامل حداقل یک عدد باشد",
      }),
  });
  