export const getAnswerForQuestion = (question: string) => {
    switch (question) {
      case "کار و رفاه اجتماعی":
        return "رجبی هستم کارشناس اداره کار و رفاه اجتماعی با 23 سال سابقه کار در این حوزه، در خدمت شما هستم . سوال خود را بپرسید.";
      case "سازمان امور مالیاتی":
        return "رجبی هستم کارشناس سازمان امور مالیاتی با 23 سال سابقه کار در این حوزه، در خدمت شما هستم . سوال خود را بپرسید.";
      case "سازمان تامین اجتماعی":
        return "رجبی هستم کارشناس سازمان تامین اجتماعی با 23 سال سابقه کار در این حوزه، در خدمت شما هستم . سوال خود را بپرسید.";
      default:
        return "پاسخ: لطفاً سوال خود را انتخاب کنید.";
    }
  };